const searchResult = new Array ();
let searchResult = [
    {
        image: '../../img/news__image_1.jpg',
        date: '2019-08-02 00:00',
        caption: 'Национальное достояние&nbsp;&mdash; парки',
        text: 'В 2016 году Америка отмечала важный юбилей: сто лет назад здесь начала складываться система национальных парков&nbsp;&mdash; охраняемых территорий, где и сегодня каждый может приобщиться к природе.',
        agency: 'ЛЕНТА.РУ',
        link: '#'
    },
    {
        image: '../../img/news__image_2.jpg',
        date: '2019-08-02 00:00',
        caption: 'Лесные огоньки: история одной фотографии',
        text: 'Фотограф отвлеклась от освещения суровой политической реальности Мексики, чтобы запечатлеть ускользающую красоту одного из местных чудес природы.',
        agency: 'МЕДУЗА',
        link: '#'
    },
    {
        image: '../../img/news__image_3.jpg',
        date: '2019-08-02 00:00',
        caption: '&laquo;Первозданная тайга&raquo; новый фотопроект Игоря Шпиленка',
        text: 'Знаменитый фотограф снимает первозданные леса России, чтобы рассказать о необходимости их сохранения. В этот раз он отправился в Двинско-Пинежскую тайгу, где...',
        agency: 'РИА',
        link: '#'
    },
    {
        image: '../../img/news__image_4.jpg',
        date: '2019-08-02 00:00',
        caption: 'Национальное достояние&nbsp;&mdash; парки',
        text: 'В 2016 году Америка отмечала важный юбилей: сто лет назад здесь начала складываться система национальных парков&nbsp;&mdash; охраняемых территорий, где и сегодня каждый может приобщиться к природе.',
        agency: 'ДЗЕН',
        link: '#'
    },
    {
        image: '../../img/news__image_5.jpg',
        date: '2019-08-02 00:00',
        caption: 'Лесные огоньки: история одной фотографии',
        text: 'Фотограф отвлеклась от освещения суровой политической реальности Мексики, чтобы запечатлеть ускользающую красоту одного из местных чудес природы.',
        agency: 'АФИША',
        link: '#'
    },
    {
        image: '../../img/news__image_6.jpg',
        date: '2019-08-02 00:00',
        caption: '&laquo;Первозданная тайга&raquo; новый фотопроект Игоря Шпиленка',
        text: 'Знаменитый фотограф снимает первозданные леса России, чтобы рассказать о необходимости их сохранения. В этот раз он отправился в Двинско-Пинежскую тайгу, где...',
        agency: 'МЕДИАЗОНА',
        link: '#'
    },
]